import React from "react";

interface PDPAProps {
  onAccept: () => void;
}

const PDPA: React.FC<PDPAProps> = ({ onAccept }) => {

    return(
        <div className="flex w-screen bg-phone justify-center items-center h-screen">
            <div className="w-3/4 h-3/4 bg-white overflow-auto p-6 rounded-lg shadow-lg font-prompt">
                <div className="font-bold text-2xl mb-2 text-center">นโยบายการจัดเก็บข้อมูลส่วนบุคคล</div>
                <div className="text-gray-700 text-lg ">
                    สโมสรนิสิตคณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัยให้ความสำคัญต่อความปลอดภัยของข้อมูลส่วนบุคคลของท่าน และเพื่อช่วยให้เราปกป้องข้อมูลส่วนบุคคล (โดยอ้างอิงนิยามของข้อมูลส่วนบุคคลในพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562) ของท่านให้ปลอดภัย ตามมาตรฐานสูงสุดสอดคล้องกับพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 สโมสรนิสิตคณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัยขอความยินยอมจากท่าน รวมถึงบทบาทที่เกี่ยวข้อง ดังนั้นเราได้กำหนดนโยบายการเก็บรวบรวมข้อมูลส่วนบุคคลดังต่อไปนี้
                    <br/> <br/>
                    เราขอเข้าถึงข้อมูลส่วนบุคคลของท่านผ่านระบบ Chula Single Sign-On (Chula SSO) ซึ่งรวมถึงชื่อ รหัสประจำตัวนิสิต ปีการศึกษา และคณะที่ท่านสังกัด โดยมีเพียงรหัสประจำตัวนิสิตของท่านที่จะถูกบันทึกลงในระบบเพื่อความสะดวกในการเข้าเว็บไซต์
                    เพื่อปรับปรุงความถูกต้องของข้อมูลในระบบ เราอาจเก็บข้อมูลการใช้งานผ่านระบบคอมพิวเตอร์หรืออุปกรณ์ที่ใช้ในการเข้าถึงเว็บไซต์ เช่น ประเภทของเบราว์เซอร์และคุกกี้ ข้อมูลเหล่านี้จะช่วยให้เราเข้าใจวิธีการใช้งานเว็บไซต์ของท่านและปรับปรุงประสบการณ์การใช้งานของท่านให้ดียิ่งขึ้น
                    ขอให้ท่านยอมรับและเห็นด้วยกับเงื่อนไขและข้อกำหนดที่ระบุในนโยบายความเป็นส่วนตัวนี้ เพื่อเข้าใช้งานระบบลงประชามติ นโยบายนี้อาจมีการเปลี่ยนแปลง และการแก้ไขใด ๆ จะถูกแจ้งให้ท่านทราบผ่านช่องทางการประชาสัมพันธ์ของสโมสรฯ
                    <br/> <br/>
                    หากท่านมีข้อสงสัยหรือข้อคำถาม กรุณาติดต่อ
                    Email: smovidyachula@gmail.com
                    Facebook: สโมสรนิสิตคณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย - CU Smovidya
                    Instagram: @smovidya_official
                </div>
                <div className="flex item-center justify-center">
                    <button onClick={onAccept} className="mt-4 py-2 px-4 bg-amber-900 text-white rounded-md hover:bg-amber-700 transition duration-300">ยอมรับ</button>
                </div>
                
            </div>
        </div>
        
    );
}
export default PDPA;